MikroElektronika/core_packages/ARM/gcc_clang/def/pic32/PIC32CX5112MTC128/mcu.h
/* ************************************************************************** */
/*               BASE ADDRESS DEFINITIONS FOR PIC32CX5112MTC128               */
/* ************************************************************************** */
#define ACC_BASE_ADDRESS                 _UINT32_(0x40028000)                          /* ACC Base Address */
#define ADC_BASE_ADDRESS                 _UINT32_(0x40024000)                          /* ADC Base Address */
#define AES_BASE_ADDRESS                 _UINT32_(0x44000000)                          /* AES Base Address */
#define AESB_BASE_ADDRESS                _UINT32_(0x44004000)                          /* AESB Base Address */
#define CHIPID_BASE_ADDRESS              _UINT32_(0x40050200)                          /* CHIPID Base Address */
#define CMCC0_BASE_ADDRESS               _UINT32_(0x46008000)                          /* CMCC0 Base Address */
#define CMCC1_BASE_ADDRESS               _UINT32_(0x4600c000)                          /* CMCC1 Base Address */
#define CPKCC_BASE_ADDRESS               _UINT32_(0x46000000)                          /* CPKCC Base Address */
#define DWDT_BASE_ADDRESS                _UINT32_(0x40052000)                          /* DWDT Base Address */
#define FLEXCOM0_BASE_ADDRESS            _UINT32_(0x40000000)                          /* FLEXCOM0 Base Address */
#define FLEXCOM1_BASE_ADDRESS            _UINT32_(0x40004000)                          /* FLEXCOM1 Base Address */
#define FLEXCOM2_BASE_ADDRESS            _UINT32_(0x40008000)                          /* FLEXCOM2 Base Address */
#define FLEXCOM3_BASE_ADDRESS            _UINT32_(0x4000c000)                          /* FLEXCOM3 Base Address */
#define FLEXCOM4_BASE_ADDRESS            _UINT32_(0x40010000)                          /* FLEXCOM4 Base Address */
#define FLEXCOM5_BASE_ADDRESS            _UINT32_(0x40014000)                          /* FLEXCOM5 Base Address */
#define FLEXCOM6_BASE_ADDRESS            _UINT32_(0x40018000)                          /* FLEXCOM6 Base Address */
#define FLEXCOM7_BASE_ADDRESS            _UINT32_(0x4001c000)                          /* FLEXCOM7 Base Address */
#define GPBR_BASE_ADDRESS                _UINT32_(0x40053060)                          /* GPBR Base Address */
#define ICM_BASE_ADDRESS                 _UINT32_(0x44010000)                          /* ICM Base Address */
#define IPC0_BASE_ADDRESS                _UINT32_(0x4002c000)                          /* IPC0 Base Address */
#define IPC1_BASE_ADDRESS                _UINT32_(0x48014000)                          /* IPC1 Base Address */
#define MATRIX0_BASE_ADDRESS             _UINT32_(0x46004000)                          /* MATRIX0 Base Address */
#define MATRIX1_BASE_ADDRESS             _UINT32_(0x40044000)                          /* MATRIX1 Base Address */
#define MATRIX2_BASE_ADDRESS             _UINT32_(0x4a000000)                          /* MATRIX2 Base Address */
#define MATRIX3_BASE_ADDRESS             _UINT32_(0x48020000)                          /* MATRIX3 Base Address */
#define MCSPI_BASE_ADDRESS               _UINT32_(0x48018000)                          /* MCSPI Base Address */
#define MEM2MEM0_BASE_ADDRESS            _UINT32_(0x40034000)                          /* MEM2MEM0 Base Address */
#define MEM2MEM1_BASE_ADDRESS            _UINT32_(0x48004000)                          /* MEM2MEM1 Base Address */
#define PIO0_BASE_ADDRESS                _UINT32_(0x40048000)                          /* PIO0 Base Address */
#define PIO1_BASE_ADDRESS                _UINT32_(0x4800c000)                          /* PIO1 Base Address */
#define PMC_BASE_ADDRESS                 _UINT32_(0x46800000)                          /* PMC Base Address */
#define PWM_BASE_ADDRESS                 _UINT32_(0x4801c000)                          /* PWM Base Address */
#define QSPI_BASE_ADDRESS                _UINT32_(0x40020000)                          /* QSPI Base Address */
#define RSTC_BASE_ADDRESS                _UINT32_(0x40053000)                          /* RSTC Base Address */
#define RTC_BASE_ADDRESS                 _UINT32_(0x40053100)                          /* RTC Base Address */
#define RTT_BASE_ADDRESS                 _UINT32_(0x40053020)                          /* RTT Base Address */
#define SEFC0_BASE_ADDRESS               _UINT32_(0x460e0000)                          /* SEFC0 Base Address */
#define SEFC1_BASE_ADDRESS               _UINT32_(0x460e0200)                          /* SEFC1 Base Address */
#define SFR_BASE_ADDRESS                 _UINT32_(0x40050400)                          /* SFR Base Address */
#define SFRBU_BASE_ADDRESS               _UINT32_(0x40050600)                          /* SFRBU Base Address */
#define SHA_BASE_ADDRESS                 _UINT32_(0x44008000)                          /* SHA Base Address */
#define SLCDC_BASE_ADDRESS               _UINT32_(0x40030000)                          /* SLCDC Base Address */
#define SUPC_BASE_ADDRESS                _UINT32_(0x400531d0)                          /* SUPC Base Address */
#define SYSCWP_BASE_ADDRESS              _UINT32_(0x400531a0)                          /* SYSCWP Base Address */
#define TC0_BASE_ADDRESS                 _UINT32_(0x40038000)                          /* TC0 Base Address */
#define TC1_BASE_ADDRESS                 _UINT32_(0x4003c000)                          /* TC1 Base Address */
#define TC2_BASE_ADDRESS                 _UINT32_(0x40040000)                          /* TC2 Base Address */
#define TC3_BASE_ADDRESS                 _UINT32_(0x48008000)                          /* TC3 Base Address */
#define TRNG_BASE_ADDRESS                _UINT32_(0x4400c000)                          /* TRNG Base Address */
#define UART_BASE_ADDRESS                _UINT32_(0x48010000)                          /* UART Base Address */
#define GPNVMBITS_BASE_ADDRESS           _UINT32_(0x00000000)                          /* FUSES Base Address */

/* ************************************************************************** */
/*                   PIO DEFINITIONS FOR PIC32CX5112MTC128                    */
/* ************************************************************************** */
// Note: Changed for MikroE implementation.
//#include "pio/pic32cx5112mtc128.h"

/* ************************************************************************** */
/*              MEMORY MAPPING DEFINITIONS FOR PIC32CX5112MTC128              */
/* ************************************************************************** */
#define PERIPHERALS_SIZE               _UINT32_(0x20000000)    /* 524288kB Memory segment type: io */
#define IFLASH0_SIZE                   _UINT32_(0x00040000)    /*  256kB Memory segment type: flash */
#define IFLASH0_PAGE_SIZE              _UINT32_(       512)
#define IFLASH0_NB_OF_PAGES            _UINT32_(       512)

#define IFLASH1_SIZE                   _UINT32_(0x00040000)    /*  256kB Memory segment type: flash */
#define IFLASH1_PAGE_SIZE              _UINT32_(       512)
#define IFLASH1_NB_OF_PAGES            _UINT32_(       512)

#define CPKCC_ROM_SIZE                 _UINT32_(0x00010000)    /*   64kB Memory segment type: other */
#define CPKCC_RAM_SIZE                 _UINT32_(0x00001000)    /*    4kB Memory segment type: other */
#define QSPI_MEM_SIZE                  _UINT32_(0x02000000)    /* 32768kB Memory segment type: other */
#define QSPI_AESB_SIZE                 _UINT32_(0x02000000)    /* 32768kB Memory segment type: other */
#define IFLASH0_CC_SIZE                _UINT32_(0x00040000)    /*  256kB Memory segment type: flash */
#define IFLASH0_CC_PAGE_SIZE           _UINT32_(       512)
#define IFLASH0_CC_NB_OF_PAGES         _UINT32_(       512)

#define IFLASH1_CC_SIZE                _UINT32_(0x00040000)    /*  256kB Memory segment type: flash */
#define IFLASH1_CC_PAGE_SIZE           _UINT32_(       512)
#define IFLASH1_CC_NB_OF_PAGES         _UINT32_(       512)

#define QSPI_MEM_CC_SIZE               _UINT32_(0x02000000)    /* 32768kB Memory segment type: other */
#define QSPI_AESB_CC_SIZE              _UINT32_(0x02000000)    /* 32768kB Memory segment type: other */
#define DTCM_SIZE                      _UINT32_(0x00002000)    /*    8kB Memory segment type: other */
#define ITCM_SIZE                      _UINT32_(0x00004000)    /*   16kB Memory segment type: other */
#define IRAM0_SIZE                     _UINT32_(0x00020000)    /*  128kB Memory segment type: ram */
#define IRAM1_SIZE                     _UINT32_(0x00008000)    /*   32kB Memory segment type: ram */
#define IRAM2_SIZE                     _UINT32_(0x00004000)    /*   16kB Memory segment type: ram */
#define PPB_SIZE                       _UINT32_(0x00100000)    /* 1024kB Memory segment type: io */

#define PERIPHERALS_ADDR               _UINT32_(0x40000000)    /* PERIPHERALS base address (type: io)*/
#define IFLASH0_ADDR                   _UINT32_(0x01000000)    /* IFLASH0 base address (type: flash)*/
#define IFLASH1_ADDR                   _UINT32_(0x01040000)    /* IFLASH1 base address (type: flash)*/
#define CPKCC_ROM_ADDR                 _UINT32_(0x02020000)    /* CPKCC_ROM base address (type: other)*/
#define CPKCC_RAM_ADDR                 _UINT32_(0x02031000)    /* CPKCC_RAM base address (type: other)*/
#define QSPI_MEM_ADDR                  _UINT32_(0x04000000)    /* QSPI_MEM base address (type: other)*/
#define QSPI_AESB_ADDR                 _UINT32_(0x06000000)    /* QSPI_AESB base address (type: other)*/
#define IFLASH0_CC_ADDR                _UINT32_(0x11000000)    /* IFLASH0_CC base address (type: flash)*/
#define IFLASH1_CC_ADDR                _UINT32_(0x11040000)    /* IFLASH1_CC base address (type: flash)*/
#define QSPI_MEM_CC_ADDR               _UINT32_(0x14000000)    /* QSPI_MEM_CC base address (type: other)*/
#define QSPI_AESB_CC_ADDR              _UINT32_(0x16000000)    /* QSPI_AESB_CC base address (type: other)*/
#define DTCM_ADDR                      _UINT32_(0x1fffa000)    /* DTCM base address (type: other)*/
#define ITCM_ADDR                      _UINT32_(0x1fffc000)    /* ITCM base address (type: other)*/
#define IRAM0_ADDR                     _UINT32_(0x20000000)    /* IRAM0 base address (type: ram)*/
#define IRAM1_ADDR                     _UINT32_(0x20080000)    /* IRAM1 base address (type: ram)*/
#define IRAM2_ADDR                     _UINT32_(0x20088000)    /* IRAM2 base address (type: ram)*/
#define PPB_ADDR                       _UINT32_(0xe0000000)    /* PPB base address (type: io)*/

/* ************************************************************************** */
/*                  DEVICE SIGNATURES FOR PIC32CX5112MTC128                   */
/* ************************************************************************** */
#define CHIP_JTAGID                    _UINT32_(0X05B4503F)
#define CHIP_CIDR                      _UINT32_(0X2C5C0AE0)
#define CHIP_EXID                      _UINT32_(0X00000000)

/* ************************************************************************** */
/*                ELECTRICAL DEFINITIONS FOR PIC32CX5112MTC128                */
/* ************************************************************************** */

#ifdef __cplusplus
}
#endif

#endif /* _PIC32CX5112MTC128_H_ */

